app/Models/ModelUser.php

SELECT *
FROM `tb_user`
---
    public function AllData()
    {
        return $this->db->table('tb_user')
        ->get()
        ->getResultArray();

UPDATE `tb_user` SET `id_user` = '1', `nama_user` = 'aditya galih', `email` = 'admin@gmail.com', `password` = 'a700909e690392e6a73a2729d39b893fd6ae34da', `level` = '1'
WHERE `id_user` = '1'
---
    public function UpdateData($data)
    {
        $this->db->table('tb_user')
        ->where('id_user', $data['id_user'])
        ->update($data);